{"page":{"title":"PRIVACY POLICY","content":"\n<p>This Privacy Policy explains how we collect, process, use, share and protect information about you. In this Privacy Policy, the words “you”, “your”, &#8220;the User&#8221; and “the Users&#8221; refer to each User, Site visitor, or Application user. &#8220;Services&#8221; refers to products, services, platform, websites and applications provided by ezyLegal.</p>\n\n\n\n<p>By using the Services, you consent to the data practices described in this Privacy Policy and our Terms of Use. If any User does not agree to our TERMS OF USE and our PRIVACY POLICY, we humbly request the user to REFRAIN USING this Site.</p>\n\n\n\n<p><strong>SCOPE AND APPLICATION</strong></p>\n\n\n\n<p>This Privacy policy applies to everyone situated in any part of the world who uses or accesses the ezyLegal website and its Services.</p>\n\n\n\n<p><strong>COLLECTION OF PERSONAL AND OTHER INFORMATION</strong></p>\n\n\n\n<p>All information that the User provides to us directly shall be stored, such as when the User creates or modifies the User’s account, requests services, contacts customer support, or otherwise communicates with us. The User takes full responsibility for ensuring that the information provided or submitted is accurate. ezylegal shall make no effort to validate any information provided by the User for use in Services with respect to content, correctness or usability. We with an intention to provide the best service possible, we could ask the User to share more information as and when needed.</p>\n\n\n\n<p>When the User uses our Services, we collect information about the User in the following general categories, including but not limited to:</p>\n\n\n\n<ol type=\"a\"><li>The Username, passwords, email address, name, address, age, date of birth, gender, nationality, site preferences, browsing history, etc., as well as any images or other information uploaded/published by the User on the Website.</li><li>Certain information about the User based upon the User’s IP address and the User’s behaviour on the Website, and the User expressly consents to the same.</li><li>If the User chooses to purchase products or services from the Website, the User’s buying behaviour and trends.</li><li>If the User chooses to post messages/reviews/feedback anywhere on the Website, including but not limited to product pages, message boards, chat rooms, other message areas, etc., all such information provided/uploaded will be collected and stored by the Company indefinitely,</li></ol>\n\n\n\n<p><strong>USE OF INFORMATION</strong></p>\n\n\n\n<p>We may use the information we collect about from the User to:</p>\n\n\n\n<ol type=\"1\"><li>Provide, maintain, and improve our Services, including, for instance, to facilitate payments, send receipts, provide products and services the User requests, develop new features, provide customer support to Users, develop safety features, authenticate Users, and send product updates and administrative messages;</li><li>Perform internal operations, including, for instance, to prevent fraud and misuse of our Services; to troubleshoot software bugs and operational problems; to conduct data analysis, testing, and research; and to monitor and analyze usage and activity trends;</li><li>Send the User communications we believe shall be of interest to the User, including information about products, services, promotions, news, and events of ezyLegal and other companies, where permissible and according to local applicable laws; and to process contest, sweepstake, or other promotion entries;</li><li>Personalize and improve the Services, including to provide or recommend features, content, social connections, referrals, promotions, surveys and advertisements.</li></ol>\n\n\n\n<p><strong>SHARING OF INFORMATION</strong></p>\n\n\n\n<p>ezyLegal reserves the right to share the information it collects from the User as described in this Statement or as described at the time of collection or sharing, including as follows:</p>\n\n\n\n<p>ezyLegal only shares Personal Information with third parties in the limited circumstances.</p>\n\n\n\n<p>We have the User’s consent for the sharing of any sensitive personal information to other trusted businesses or persons for the purpose of processing User’s information on our behalf. We require that these parties agree to process such information based on our instructions and in compliance with this Policy and any other appropriate confidentiality and security measures. We have a good faith belief that access, use, preservation or disclosure of such information is reasonably necessary to:</p>\n\n\n\n<ul><li>satisfy any applicable law, regulation, legal process or enforceable governmental request including to law enforcement and in response to a court order,</li><li>detect, prevent, or otherwise address fraud, technical or security issues, enforce applicable Terms of Use, including investigation of potential violations thereof, or</li><li>To protect ourselves against third-party claims.</li></ul>\n\n\n\n<p><strong>INFORMATION SECURITY</strong></p>\n\n\n\n<p>ezyLegal takes precautions and this includes administrative, technical, and physical measures – to safeguard the User&#8217;s personal and sensitive information against loss, misuse or theft, as well as against destruction, alteration, disclosure and unauthorized access. However, no security system can be completely secure. Therefore, despite our best efforts for safeguarding User’s Privacy we cannot guarantee the complete security of the User’s Personal Information.</p>\n\n\n\n<p>Please exercise caution when determining what Personal Information the User discloses via the Site. When the User uses our services or uploads/posts information on the Site, some of the Personal Information the User shares is visible to other Users and can be read, collected, or used by any other User. The Users are responsible for such Personal&nbsp;Information the User chooses to submit in such instances. For instance, if the User lists the User’s name and email address on any page on the Site, that information is public. Further, the Users are responsible for maintaining the confidentiality of the User’s account and password and for restricting access to the User’s computer, and the User agrees to accept responsibility for all activities that occur under the User’s account or password.</p>\n\n\n\n<p><strong>ANALYTICS AND THIRD PARTY ADVERTISEMENTS/PROMOTIONS</strong></p>\n\n\n\n<p>ezyLegal may allow third party websites to provide audience measurement and analytics services on the ezyLegal website. ezyLegal may even allow third party websites to serve advertisements on our behalf across the Internet, and to monitor, track and report performance of those advertisements. Furthermore, the Website may contain links to other websites that may collect personally identifiable information about the User.&nbsp; ezyLegal will not be responsible for the privacy practices or the content of any of the linked websites, and the User expressly acknowledges the same and agrees that any and all risks associated with data privacy will be borne entirely by the User.</p>\n\n\n\n<p><strong>COOKIES</strong><br>Our website uses &#8220;cookies&#8221; to help personalize the User’s online experience. A cookie is a text file that is placed on the User’s device by a web server. Cookies are uniquely assigned to the User and can only be read by a web server in the domain that issued the cookie to the User.</p>\n\n\n\n<p><strong>ACCOUNT INFORMATION</strong></p>\n\n\n\n<p>The User may correct the User’s account information at any time by logging into the User’s online account on the website. If the User wishes to cancel the account, please email us at <a href=\"mailto:contact@ezylegal.in\">contact@ezylegal.in</a>. Please note that in some cases we may retain certain information about the User as required by law, or for legitimate business purposes to the extent permitted by law. For instance, if the User has a standing credit or debt on the User’s account, or if we believe the User has committed fraud or violated our Terms, we may seek to resolve the issue before deleting the User’s information.</p>\n\n\n\n<p><strong>PROMOTIONAL COMMUNICATIONS</strong></p>\n\n\n\n<p>The User may opt out of receiving promotional messages from ezylegal by following the Unsubscribe instructions mentioned in those messages. If the User opts-out, we may still send the User non-promotional/transactional communications, such as those about the User account, Account balance, Status Updates about Services the User has requested, or purchased.</p>\n\n\n\n<p><strong>CHANGES/MODIFICATIONS TO THE POLICY</strong></p>\n\n\n\n<p>Due to the rapidly evolving technologies on the world wide web and amendments in the law pertaining to the Internet, we may update this privacy policy occasionally. All revisions will be posted on our website itself. Hence, we urge the User to review our Privacy Policy frequently. The User’s continued use of the Services after such notice shall mean the User’s consent to the changes. We encourage the User to periodically visit the website for the latest information on our privacy practices.</p>\n\n\n\n<p><strong>ASSIGNMENT</strong></p>\n\n\n\n<p>We may assign this contract at any time to any parent, subsidiary, or any affiliated company, or as part of the sale to, merger with, or other transfer of our company to another entity. We will post a notice on the website regarding any change of ownership so that you have the opportunity to discontinue your use of the website or cancel your registration if you do not wish to continue to use the website and the Services under the new ownership.</p>\n\n\n\n<p><strong>DISPUTE RESOLUTION AND JURISDICTION</strong></p>\n\n\n\n<p>It is expressly agreed to by the User that the formation, interpretation and performance of this Policy and any disputes arising herefrom will be resolved through an Alternate Dispute Resolution (“ADR”) mechanism. It is further agreed to by the Parties that the contents of this Section shall survive even after the termination or expiry of the Policy and/or Terms.</p>\n\n\n\n<p>In the event that the User is not satisfied with the resolution provided by ezyLegal and there exists a dispute, then the said dispute will be referred to arbitration by a sole arbitrator to be appointed by ezyLegal, and the award passed by such sole arbitrator will be valid and binding on both Parties. The Parties shall bear their own costs for the proceedings, although the sole arbitrator may, in his/her sole discretion, direct either Party to bear the entire cost of the proceedings. The arbitration shall be conducted in English, and the seat of Arbitration shall be the city of New Delhi in the state of Delhi, India.</p>\n\n\n\n<p>The Parties expressly agree that the Terms of Use and Privacy Policy and any other agreements entered into between the Parties are governed by the laws, rules and regulations of India, and that the Courts at Delhi (India), shall have exclusive jurisdiction over any disputes arising between the Parties.</p>\n\n\n\n<p><strong>GRIEVANCE OFFICER</strong></p>\n\n\n\n<p>If the User finds any inconsistencies or has any grievances in relation to the collection, storage, use, disclosure and transfer of the User’s personal information under this Policy or any terms of ezyLegal’s Terms of Use, Privacy Policy, etc. please contact the following: <a href=\"mailto:contact@ezylegal.in\">contact@ezylegal.in</a> &nbsp;&nbsp;</p>\n\n\n\n<p>The Grievance Officer shall redress the grievances expeditiously within a maximum period of one month, from the date of receipt of a grievance.</p>\n\n\n\n<p><strong>MISCELLANEOUS</strong></p>\n\n\n\n<p>While ezyLegal may retain any correspondence sent by the User, it does not intend to collect or save any information from children below 18 years of age. This website is also not intended for Users who are not competent to contract under the provisions of Indian Contract Act, 1872.</p>\n\n\n\n<p>Further, any information sent to us by Internet e-mail or via the Website is done at the User’s risk and hence is not secure and is done so on a non-confidential basis. If the User has any questions about this privacy statement or needs any clarification on the same, the User can contact us at <a href=\"mailto:contact@ezylegal.in\">contact@ezylegal.in</a>.</p>\n\n\n\n<p><strong>USER’S CONSENT</strong></p>\n\n\n\n<p>By using the Website and/or by providing information to ezyLegal through the website, the User consents to the collection and use of the information disclosed by the User on the website in accordance with this Privacy Policy.</p>\n","addition_field":{"subHeading":"Your privacy matters!","subSubHeading":"Protecting your private information is a priority for Neo Online Ventures Pvt. Ltd, which shall be hereafter referred to as “ezyLegal” or “company” or “we” or “us”."}}}